<a href="https://colab.research.google.com/github/Truman7777/M1/blob/main/M1%EA%B3%B5%EB%B6%80_04.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Pandas

In [ ]:
# 데이터프레임

import numpy as np
import pandas as pd

dic = {'city': ['서울', '뉴욕', '런던', '프라하'],
       'year': [2016, 2021, 2031, 2056],
       'temp': [19, 20, 25, 37]}
data = pd.DataFrame(dic)
data

  city  year  temp
0   서울  2016    19
1   뉴욕  2021    20
2   런던  2031    25
3  프라하  2056    37

In [ ]:
# 컬럼 순서 바꾸기
data[['temp', 'city', 'year']]

   temp city  year
0    19   서울  2016
1    20   뉴욕  2021
2    25   런던  2031
3    37  프라하  2056

In [ ]:
# 인덱스 이름 지정하기
data.index = ['a', 'b', 'c', 'd']
data

  city  year  temp
a   서울  2016    19
b   뉴욕  2021    20
c   런던  2031    25
d  프라하  2056    37

In [ ]:
# 컬럼 이름 바꾸기
data.columns = ['도시', '연도', '기온']
data

    도시    연도  기온
a   서울  2016  19
b   뉴욕  2021  20
c   런던  2031  25
d  프라하  2056  37

In [ ]:
# 특정 열을 얻는 방법
data['기온']

a    19
b    20
c    25
d    37
Name: 기온, dtype: int64

In [ ]:
data.기온

a    19
b    20
c    25
d    37
Name: 기온, dtype: int64

In [ ]:
# 특정 행을 얻는 방법
data.loc['c']

도시      런던
연도    2031
기온      25
Name: c, dtype: object

In [ ]:
data.iloc[1:3]

   도시    연도  기온
b  뉴욕  2021  20
c  런던  2031  25

In [ ]:
data.set_index(['도시'], inplace= True) # set_index -> 특정 열을 인덱스로 설정
data # inplace= True -> 결과를 즉각 데이터프레임에 반영

       연도  기온
도시
서울   2016  19
뉴욕   2021  20
런던   2031  25
프라하  2056  37

In [ ]:
# 컬럼 추가
houses = [20, 30, 10, 50]
data['house'] = houses
data

       연도  기온  house
도시
서울   2016  19     20
뉴욕   2021  20     30
런던   2031  25     10
프라하  2056  37     50

In [ ]:
data['high'] = data.house >= 30
data

       연도  기온  house   high
도시
서울   2016  19     20  False
뉴욕   2021  20     30   True
런던   2031  25     10  False
프라하  2056  37     50   True

In [ ]:
data.drop(['house', 'high'], 1)

       연도  기온
도시
서울   2016  19
뉴욕   2021  20
런던   2031  25
프라하  2056  37

In [ ]:
# apply -> 함수를 데이터에 일괄 적용 시킴

f = lambda x: x.max() - x.min()

df = pd.DataFrame(np.arange(12).reshape(4, 3),
                columns= ['A','B','C'],
                index= ['a', 'b', 'c', 'd'])
print(df)

   A   B   C
a  0   1   2
b  3   4   5
c  6   7   8
d  9  10  11

In [ ]:
df.apply(f)

A    9
B    9
C    9
dtype: int64

In [ ]:
df.apply(f, axis= 1)

a    2
b    2
c    2
d    2
dtype: int64

In [ ]:
# Series -> 컬럼이 하나뿐인 데이터프레임
region = pd.Series(['서울', '부산', '대전', '대구', '광주'],
                   index = ['1', '2', '3', '4', '5'])
print(region)

1    서울
2    부산
3    대전
4    대구
5    광주
dtype: object